## Final_Task
# ЗАДАЧА: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
# РЕШЕНИЕ:

_string[] array = { "0", "25", "world", ":-)" };_
_int counter = 0;_
_for (int i = 0; i < array.Length; i++)_
_{_
                        _if (array[i].Length <= 3)_
                        _{_
                                                _counter++;_
                        _}_
_}_
_string[] newArray = new string[counter];_
_counter = 0;_
_for (int i = 0; i < array.Length; i++)_
_{_
                        _if (array[i].Length <= 3)_
                        _{_
                                                _newArray[counter] = array[i];_
                                                _counter++;_
                        _}_
_}_
_Console.WriteLine(String.Join(",", newArray));_

# ОПИСАНИЕ:

1. Создаем массив на старте выполнения алгоритма.
2. Создаем счетчик *counter* для понимания размера созданного массива.
3. С помощью цикла *for* прогоняем созданный массив и фиксируем в счетчике количество элементов.
4. Создаем новый массив *newArray* определенной длины (*counter*).
5. Обнуляем счетчик, чтобы не множить переменные, и запускаем новый цикл *for* для определения элементов, длина которых меньше, либо равна 3 символам.
6. Записываем эти элементы в новый массив *newArray*.
7. Выводим новый массив *newArray*.